{
  "packageLang": "en",
  "en": "English",
  "tc": "Traditional Chinese",
  "zh": "Traditional Chinese",

  "home": "Home",
  "aboutMe": "About Me",
  "aboutMeDesc": "A glimpse into my journey, skills, and the passion that drives my work.",
  "detailDesc": "Full-Stack Software Developer with expertise in web & mobile apps, microservices, and cloud (AWS). Skilled in React, Next.js, React Native, Docker/Kubernetes, and CI/CD. I deliver end-to-end solutions, design scalable architectures, and turn ideas into impactful products.",
  "myProjects": "My Projects",
  "blog": "Blog",
  "contactMe": "Contact",
  "viewMyProjects": "View My Projects",
  "viewProjectsDesc": "Explore a showcase of my latest design and development work, from concept to execution.",
  "latestProjects": "Latest Projects",
  "seeLatestProjects": "See Latest Projects",
  "viewAllProjects": "View All Projects",
  "seeLatestPosts": "See Latest Posts",
  "viewPostsDesc": "Dive into insights, tutorials, and thoughts I share on design, coding, and the creative process.",
  "viewAllPosts": "View All Posts",
  "backToHome": "Back to Home",
  "back": "Back",

  "goodman": "Goodman",
  "subTitle": "Crafting Ideas Into Impact",
  "slogan": "Design · Code · Deliver",

  "ourExpertise": "Our Expertise",
  "softwareDev": "Software Development",
  "softwareDevDesc": "We don’t do one-size-fits-all. From handy tools to full-scale platforms, we build software that works the way you work.",
  "QualityControl": "Quality Control",
  "QualityControlDesc": "Bugs happen—but they don’t have to reach your users. We help strengthen your technology with rigorous manual and automated testing to ensure reliability and performance.",
  "WebMoblileApp": "Web & Mobile App Development",
  "WebMoblileAppDesc": "From sleek websites to powerful mobile apps, we create digital experiences that captivate and engage your audience across all devices.",
  "UIUXDesign": "UI/UX Design",
  "UIUXDesignDesc": "Good design is more than pretty pixels. We focus on clean, thoughtful, and easy-to-use interfaces that make people smile.",
  "Infrastructure": "Infrastructure",
  "InfrastructureDesc": "Build resilient, secure, and scalable systems with our DevOps and Security expertise to keep your business running flawlessly.",
  "MultilingualDev": "Multilingual Development",
  "MultilingualDevDesc": "Our team is native in both Chinese and English, making it easier to build software that works seamlessly across languages and cultures.",

  "myExpertise": "My Expertise",
  "aboutMeSoftwareDevDesc": "I build end-to-end web apps with React/Next.js on the front and Node/Java/Spring or serverless backends—shipped with clean APIs and strong foundations.",
  "aboutMeQualityControlDesc": "I value correctness. Tests, CI/CD, and pragmatic monitoring are part of my routine to ship safely and iterate with confidence.",
  "aboutMeWebMobileAppDesc": "From responsive web to React Native, I focus on fast interactions, accessibility, and user-friendly flows that feel natural.",
  "aboutMeUIUXDesignDesc": "Clean, readable, and purposeful interfaces. I care about hierarchy, motion, and details that make products feel polished.",
  "aboutMeInfrastructureDesc": "I design scalable services and event-driven systems, containerize with Docker/Kubernetes, and deploy on AWS when it fits.",
  "aboutMeMultilingualDevDesc": "Comfortable working across English and Chinese contexts, aligning requirements, and turning ideas into clear, actionable plans.",

  "getInTouch": "Get In Touch",

  "goodmanDev": "Goodman Dev.",
  "softwareDevelopment": "Software Development",
  "goodmanDevDesc": "Custom software, web & mobile app fullstack development",
  "aboutUs": "About Us",
  "aboutUsDesc": "We are a small, nimble freelance team. Being small means we can respond quickly and move fast, without the red tape to get started. While we may be few in number, each member is an expert in their field—front-end, back-end, infrastructure, UI/UX design—and together we form a team capable of delivering end-to-end projects. We believe software development is more than just a job; it's about solving problems with heart and turning ideas into working products. We love collaborating closely with clients, brainstorming together, and iterating to ensure the final result fits your needs just right.",
  "ourTechStack": "Our Tech Stack",

  "shareDetails": "Share a few details and We will reply shortly.",
  "startProject": "Start a Project",
  "projectType": "Project Type",
  "projectDescription": "Project Description",
  "tellUsAboutProject": "Tell us about your project",
  "preferTechStack": "Preferred Tech Stack (optional)",
  "techStack": "Tech Stack",
  "budget": "Budget",
  "companySize": "Company Size",
  "yourName": "Your Name",
  "email": "Email",
  "submitEnquiry": "Submit Enquiry",
  "enqueryReceived": "Thanks! Your enquiry has been received. We will get back to you soon.",
  "contact": "Contact"
}
